/*
2 
Составить программу для вычисления значения выражения S=2(X^2+Y^2)/(X+Y) для введенных X и Y.
*/

знач_выраж(X, Y):- ((X + Y) =\= 0), Рез is 2 * (X * X + Y * Y) / (X + Y),
                   write("Рез = "), write(Рез);
                   writeln("Ошибка ввода.").

?- writeln("").
?- writeln("X = 3, Y = 4: ").
?- знач_выраж(3, 4).
?- writeln("").
?- writeln("").
?- writeln("X = 0, Y = 0: ").
?- знач_выраж(0, 0).
?- writeln("").
?- writeln("X = 3, Y = 0: ").
?- знач_выраж(3, 0).
?- writeln("").
?- writeln("X = 0, Y = 3: ").
?- знач_выраж(0, 3).
?- writeln("").

/*
4
Составить программу для проверки введенного натурального числа на четность.
*/

проверка_четности(X):- Рез is (X mod 2), Рез == 1,
                       write("Число нечетное!"); write("Число четное!").

?- writeln("").
?- writeln("X = 3: ").
?- проверка_четности(3).
?- writeln("").
?- writeln("X = 6: ").
?- проверка_четности(6).
?- writeln("").

/*
6
Составить программу для выбора наименьшего из трех введенных чисел. 
*/

min(A, B, A):- A =< B, !.
min(A, B, B).
наименьшее(X, Y, Z):- min(X, Y, Min), min(Y, Z, Min2), min(Min, Min2, Min3), write("Наименьшее из трёх: "), write(Min3), nl.

?- writeln("").
?- writeln("3, 4, 6: ").
?- наименьшее(3, 4, 6).
?- writeln("").
?- writeln("1, 2, 22: ").
?- наименьшее(1, 2, 22).
?- writeln("").
?- writeln("10, 2, 22: ").
?- наименьшее(10, 2, 22).
?- writeln("").
?- writeln("10, 211, 22: ").
?- наименьшее(100, 211, 22).
?- writeln("").